Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/gitlab.tmx
Source language: en
Languages: sv

source: Personal access token is required.
sv: Personlig åtkomsttoken krävs.

source: Please confirm the password you entered above.
sv: Bekräfta lösenordet du angav ovan.

source: Please enter your current password.
sv: Ange ditt nuvarande lösenord.

source: Please select and add a member
sv: Välj och lägg till en medlem

source: Private - Project access must be granted explicitly to each user. If this project is part of a group, access will be granted to members of the group.
sv: Privat – projektåtkomst måste beviljas uttryckligen till varje användare. Om projektet ingår i en grupp beviljas åtkomst till gruppens medlemmar.

source: Private - The group and its projects can only be viewed by members.
sv: Privat – gruppen och dess projekt kan bara visas av medlemmar.

source: GitLabPages|When enabled, all access to domains will use HTTPS with %{redirect_code} redirects. Requires valid certificates for all domains. %{docs_link_start}How does HTTPS redirection work?%{link_end}
sv: GitLabPages|När funktionen är aktiverad använder all åtkomst till domäner HTTPS med omdirigeringar med %{redirect_code}. Giltiga certifikat krävs för alla domäner. %{docs_link_start}Hur fungerar HTTPS-omdirigering%{link_end}

source: GroupSettings|Disable SSH Keys
sv: GroupSettings|Inaktivera SSH-nycklar

source: GroupSettings|If enabled, enterprise users cannot use SSH Keys. %{learn_more_link}.
sv: GroupSettings|Om aktiverat kan företagsanvändare inte använda SSH-nycklar. %{learn_more_link}.

source: GroupSettings|Members cannot invite groups outside of %{group} and its subgroups
sv: GroupSettings|Medlemmar kan inte bjuda in grupper utanför %{group} och dess undergrupper

source: New Protected Branch
sv: Ny skyddad gren

source: OutboundRequests|Enforce DNS-rebinding attack protection
sv: OutboundRequests|Tvinga igenom skydd mot DNS-rebindningsattacker

source: OutboundRequests|Local IP addresses and domain names that hooks and integrations can access
sv: OutboundRequests|Lokala IP-adresser och domännamn som hooks och integreringar kan komma åt

source: Owasp|A01:2021 Broken Access Control
sv: Owasp|A01:2021 Bristande åtkomstkontroll

source: Owasp|A01:2025 Broken Access Control
sv: Owasp|A01:2025 Bristande åtkomstkontroll

source: Owasp|A5:2017 Broken Access Control
sv: Owasp|A5:2017 Bristande åtkomstkontroll

source: PagesDomain|Certificate Key is too long. (Max %d bytes)
sv: PagesDomain|Certifikatnyckeln är för lång. (Högst %d byte)

source: Passkey added successfully! Next time you sign in, select the sign-in with passkey option. Passkey is now your default 2FA method.
sv: Passkey har lagts till. Nästa gång du loggar in väljer du alternativet för att logga in med passkey. Passkey är nu din standardmetod för tvåfaktorsautentisering.

source: Passkey deleted
sv: Passkey togs bort

source: Protected Paths: requests
sv: Skyddade sökvägar: förfrågningar

source: Protected environments
sv: Skyddade miljöer

source: ProtectedEnvironments|%d approval rule
sv: ProtectedEnvironments|%d godkännanderegel

source: ProtectedEnvironments|%d approval rules
sv: ProtectedEnvironments|%d godkännanderegler

source: ProtectedEnvironments|%d deployment rule
sv: ProtectedEnvironments|%d driftsättningsregel

source: ProtectedEnvironments|%d deployment rules
sv: ProtectedEnvironments|%d driftsättningsregler

source: ProtectedTags|Unprotect tag
sv: ProtectedTags|Ta bort skydd för tagg

source: PushRules|Check whether the commit author is a GitLab user
sv: PushRules|Kontrollera om incheckningens författare är en GitLab-användare

source: PushRules|Commit author's email
sv: PushRules|Incheckningsförfattarens e-postadress

source: Are you sure you want to delete this branch target?
sv: Are you sure you want to delete this branch target?|Vill du verkligen ta bort det här grenmålet?

source: Branch is already taken
sv: Branch is already taken|Grenen används redan

source: Branch name copied to clipboard.
sv: Branch name copied to clipboard.|Grennamnet har kopierats till urklipp.

source: Branch name is available
sv: Branch name is available|Grennamnet är tillgängligt

source: Branch name is required
sv: Branch name is required|Grennamn krävs

source: Branch name pattern
sv: Branch name pattern|Grennamnsmönster

source: Branch target
sv: Branch target|Grenmål

source: Branch target created.
sv: Branch target created.|Grenmålet har skapats.

source: Branch target deleted.
sv: Branch target deleted.|Grenmålet har tagits bort.

source: Branch target does not exist
sv: Branch target does not exist|Grenmålet finns inte

source: BranchRules|Allowed to merge updated
sv: BranchRules|Allowed to merge updated|Behörighet att sammanfoga har uppdaterats

source: BranchRules|Allowed to push and merge
sv: BranchRules|Allowed to push and merge|Behörighet att skicka upp och sammanfoga

source: BranchRules|Allowed to push and merge updated
sv: BranchRules|Allowed to push and merge updated|Behörigheten att skicka upp och sammanfoga har uppdaterats

source: BranchRules|Branch name cannot exceed 255 characters.
sv: BranchRules|Branch name cannot exceed 255 characters.|Grennamnet får inte vara längre än 255 tecken.

source: BranchRules|Branch name or pattern
sv: BranchRules|Branch name or pattern|Grennamn eller mönster

source: BranchRules|Changes require a merge request. The following users can push and merge directly.
sv: BranchRules|Changes require a merge request. The following users can push and merge directly.|Ändringar kräver en sammanfogningsbegäran. Följande användare kan skicka upp och sammanfoga direkt.

source: BranchRules|Edit allowed to merge
sv: BranchRules|Edit allowed to merge|Redigera behörighet att sammanfoga

source: BranchRules|Edit allowed to push and merge
sv: BranchRules|Edit allowed to push and merge|Redigera behörighet att skicka upp och sammanfoga

source: BranchRules|Merge requests
sv: BranchRules|Merge requests|Sammanfogningsbegäranden

source: BranchRules|No one is allowed to merge changes.
sv: BranchRules|No one is allowed to merge changes.|Ingen får sammanfoga ändringar.

source: BranchRules|No one is allowed to push and merge changes.
sv: BranchRules|No one is allowed to push and merge changes.|Ingen får skicka upp och sammanfoga ändringar.

source: BranchRules|Select branch or create rule
sv: BranchRules|Select branch or create rule|Välj gren eller skapa regel

source: BranchRules|Set the default behavior of this option in merge requests. Changes to this are also applied to existing merge requests. %{linkStart}What is squashing?%{linkEnd}
sv: BranchRules|Set the default behavior of this option in merge requests. Changes to this are also applied to existing merge requests. %{linkStart}What is squashing?%{linkEnd}|Ange standardbeteendet för det här alternativet i sammanfogningsbegäranden. Ändringar tillämpas även på befintliga sammanfogningsbegäranden. %{linkStart}Vad är squashning?%{linkEnd}

source: BranchRules|Something went wrong while creating branch rule.
sv: BranchRules|Something went wrong while creating branch rule.|Något gick fel när grenregeln skapades.

source: BranchRules|Something went wrong while deleting branch rule.
sv: BranchRules|Something went wrong while deleting branch rule.|Något gick fel när grenregeln togs bort.

source: BranchRules|Something went wrong while updating branch rule.
sv: BranchRules|Something went wrong while updating branch rule.|Något gick fel när grenregeln uppdaterades.

source: BranchRules|Target branch
sv: BranchRules|Target branch|Målgren

source: BranchRules|Update target branch
sv: BranchRules|Update target branch|Uppdatera målgren

source: Branches|After you confirm and select %{strongStart}%{buttonText},%{strongEnd} you cannot recover this branch.
sv: Branches|After you confirm and select %{strongStart}%{buttonText},%{strongEnd} you cannot recover this branch.|När du har bekräftat och valt %{strongStart}%{buttonText},%{strongEnd} kan du inte återställa den här grenen.

source: Branches|Can’t find HEAD commit for this branch
sv: Branches|Can’t find HEAD commit for this branch|Det gick inte att hitta HEAD-incheckningen för den här grenen

source: CI/CD Catalog
sv: CI/CD Catalog|CI/CD-katalog

source: CiCatalogComponent|CI/CD Catalog
sv: CiCatalogComponent|CI/CD Catalog|CI/CD-katalog

source: CiCatalog|Back to the CI/CD Catalog
sv: CiCatalog|Back to the CI/CD Catalog|Tillbaka till CI/CD-katalogen

source: CiCatalog|CI/CD Catalog
sv: CiCatalog|CI/CD Catalog|CI/CD-katalog

source: CiCatalog|CI/CD Catalog (unpublished)
sv: CiCatalog|CI/CD Catalog (unpublished)|CI/CD-katalogen (opublicerad)

source: CiCatalog|CI/CD Catalog project
sv: CiCatalog|CI/CD Catalog project|CI/CD-katalogprojekt

source: CiCatalog|Catalog project (unpublished)
sv: CiCatalog|Catalog project (unpublished)|Katalogprojekt (opublicerat)

source: CiCatalog|Create a pipeline component repository and make reusing pipeline configurations faster and easier.
sv: CiCatalog|Create a pipeline component repository and make reusing pipeline configurations faster and easier.|Skapa ett projektarkiv för pipelinekomponenter och gör återanvändning av pipelinekonfigurationer snabbare och enklare.

source: CiCatalog|Discover CI/CD components that can improve your pipeline with additional functionality.
sv: CiCatalog|Discover CI/CD components that can improve your pipeline with additional functionality.|Hitta CI/CD-komponenter som kan förbättra din pipeline med ytterligare funktioner.

source: CiCatalog|Edit your search and try again, or %{linkStart}learn how to create a component project%{linkEnd}.
sv: CiCatalog|Edit your search and try again, or %{linkStart}learn how to create a component project%{linkEnd}.|Ändra sökningen och försök igen eller %{linkStart}läs hur du skapar ett komponentprojekt%{linkEnd}.

source: CiCatalog|Get started with the CI/CD Catalog
sv: CiCatalog|Get started with the CI/CD Catalog|Kom i gång med CI/CD-katalogen

source: CiCatalog|Number of unique projects that used a component from this catalog project in a pipeline in the last 30 days.
sv: CiCatalog|Number of unique projects that used a component from this catalog project in a pipeline in the last 30 days.|Antal unika projekt som under de senaste 30 dagarna har använt en komponent från det här katalogprojektet i en pipeline.

source: CiCatalog|Number of unique projects that used a component from this catalog project in their pipelines in the last 30 days.
sv: CiCatalog|Number of unique projects that used a component from this catalog project in their pipelines in the last 30 days.|Antal unika projekt som under de senaste 30 dagarna har använt en komponent från det här katalogprojektet i sina pipelines.

source: CiCatalog|Project path
sv: CiCatalog|Project path|Projektsökväg

source: CiCatalog|Publish the CI/CD components in this project to the CI/CD Catalog
sv: CiCatalog|Publish the CI/CD components in this project to the CI/CD Catalog|Publicera CI/CD-komponenterna i det här projektet i CI/CD-katalogen

source: CiCatalog|Remove component project from the CI/CD Catalog?
sv: CiCatalog|Remove component project from the CI/CD Catalog?|Ta bort komponentprojektet från CI/CD-katalogen?

source: CiCatalog|Remove from the CI/CD catalog
sv: CiCatalog|Remove from the CI/CD catalog|Ta bort från CI/CD-katalogen

source: CiCatalog|Set component project as a CI/CD Catalog project. %{linkStart}What is the CI/CD Catalog?%{linkEnd}
sv: CiCatalog|Set component project as a CI/CD Catalog project. %{linkStart}What is the CI/CD Catalog?%{linkEnd}|Gör komponentprojektet till ett CI/CD-katalogprojekt. %{linkStart}Vad är CI/CD-katalogen?%{linkEnd}

source: CiCatalog|There was a problem fetching the CI/CD Catalog setting.
sv: CiCatalog|There was a problem fetching the CI/CD Catalog setting.|Det gick inte att hämta inställningen för CI/CD-katalogen.

source: CiCatalog|There was an error fetching CI/CD Catalog projects.
sv: CiCatalog|There was an error fetching CI/CD Catalog projects.|Det gick inte att hämta CI/CD-katalogprojekt.

source: CiCatalog|There was an error fetching the CI/CD Catalog project count.
sv: CiCatalog|There was an error fetching the CI/CD Catalog project count.|Det gick inte att hämta antalet CI/CD-katalogprojekt.

source: CiCatalog|This project is no longer a CI/CD Catalog project.
sv: CiCatalog|This project is no longer a CI/CD Catalog project.|Det här projektet är inte längre ett CI/CD-katalogprojekt.

source: CiCatalog|This project is now a CI/CD Catalog project.
sv: CiCatalog|This project is now a CI/CD Catalog project.|Det här projektet är nu ett CI/CD-katalogprojekt.

source: CiCatalog|This project is set as a Catalog project, but has not yet been published. Publish this project to the Catalog to make it available. %{linkStart}Learn how to publish a new release%{linkEnd}
sv: CiCatalog|This project is set as a Catalog project, but has not yet been published. Publish this project to the Catalog to make it available. %{linkStart}Learn how to publish a new release%{linkEnd}|Det här projektet är angett som katalogprojekt, men har ännu inte publicerats. Publicera projektet i katalogen för att göra det tillgängligt. %{linkStart}Läs hur du publicerar en ny version%{linkEnd}

source: CiCatalog|Unable to set project as a CI/CD Catalog project.
sv: CiCatalog|Unable to set project as a CI/CD Catalog project.|Det går inte att ange projektet som ett CI/CD-katalogprojekt.

source: CiVariables|Disable pipeline variables in projects that don't use them
sv: CiVariables|Disable pipeline variables in projects that don't use them|Stäng av pipelinevariabler i projekt som inte använder dem

source: CiVariables|Display all manually-defined variables in the pipeline details page after running a pipeline manually.
sv: CiVariables|Display all manually-defined variables in the pipeline details page after running a pipeline manually.|Visa alla manuellt definierade variabler på sidan med pipelinedetaljer efter att en pipeline har körts manuellt.

source: CiVariables|Display manually-defined pipeline variables
sv: CiVariables|Display manually-defined pipeline variables|Visa manuellt definierade pipelinevariabler

source: CiVariables|Display pipeline variables
sv: CiVariables|Display pipeline variables|Visa pipelinevariabler

source: CiVariables|Pipeline variables cannot be used.
sv: CiVariables|Pipeline variables cannot be used.|Pipelinevariabler kan inte användas.

source: AdminUsers|This user has been set to pending approval. Their existing group and project memberships have been preserved and can be restored when seats become available.
sv: AdminUsers|This user has been set to pending approval. Their existing group and project memberships have been preserved and can be restored when seats become available.|Den här användaren har satts till väntande godkännande. Befintliga grupp- och projektmedlemskap har bevarats och kan återställas när platser blir tillgängliga.

source: Average time from creation to merge, in seconds.
sv: Average time from creation to merge, in seconds.|Genomsnittlig tid från skapande till sammanfogning, i sekunder.

source: Before inserting code, be sure to read the comment that separated each code group.
sv: Before inserting code, be sure to read the comment that separated each code group.|Läs kommentaren som skiljer varje kodgrupp åt innan du infogar kod.

source: BillingPlans|Automatically merge changes in sequence to prevent conflicts and keep your branch stable.
sv: BillingPlans|Automatically merge changes in sequence to prevent conflicts and keep your branch stable.|Sammanfoga ändringar i ordningsföljd automatiskt för att förhindra konflikter och hålla grenen stabil.

source: BillingPlans|Customizable pre-receive Git hooks that enforce commit content standards, message formats, branch naming rules, and file requirements.
sv: BillingPlans|Customizable pre-receive Git hooks that enforce commit content standards, message formats, branch naming rules, and file requirements.|Anpassningsbara Git-hookar före mottagning som framtvingar standarder för incheckningsinnehåll, meddelandeformat, regler för grennamn och filkrav.

source: BillingPlans|Merge Trains
sv: BillingPlans|Merge Trains|Sammanfogningståg

source: BillingPlans|Merge trains
sv: BillingPlans|Merge trains|Sammanfogningståg

source: Billings|Team Project Management
sv: Billings|Team Project Management|Projektledning för team

source: Billing|Invited group
sv: Billing|Invited group|Inbjuden grupp

source: BlobViewer|If you delete the file, it will be removed from the branch %{branch}.
sv: BlobViewer|If you delete the file, it will be removed from the branch %{branch}.|Om du tar bort filen tas den bort från grenen %{branch}.

source: Blocking merge request not found
sv: Blocking merge request not found|Blockerande sammanfogningsbegäran hittades inte

source: Boards|An error occurred while moving the issue. Please try again.
sv: Boards|An error occurred while moving the issue. Please try again.|Ett fel uppstod när ärendet flyttades. Försök igen.

source: Boards|Because this is the only board in this project, when this board is deleted, a new default Development board will be created.
sv: Boards|Because this is the only board in this project, when this board is deleted, a new default Development board will be created.|Eftersom detta är den enda tavlan i projektet skapas en ny standardtavla för utveckling när tavlan tas bort.

source: Boards|Create new issue
sv: Boards|Create new issue|Skapa nytt ärende

source: Branches|Deleting the %{strongStart}%{branchName}%{strongEnd} branch cannot be undone. Are you sure?
sv: Branches|Deleting the %{strongStart}%{branchName}%{strongEnd} branch cannot be undone. Are you sure?|Det går inte att ångra borttagningen av grenen %{strongStart}%{branchName}%{strongEnd}. Vill du fortsätta?

source: Branches|The branch could not be updated automatically because it has diverged from its upstream counterpart.
sv: Branches|The branch could not be updated automatically because it has diverged from its upstream counterpart.|Grenen kunde inte uppdateras automatiskt eftersom den har avvikit från sin uppströmsmotsvarighet.

source: Branches|This branch hasn't been merged into %{defaultBranchName}. To avoid data loss, consider merging this branch before deleting it.
sv: Branches|This branch hasn't been merged into %{defaultBranchName}. To avoid data loss, consider merging this branch before deleting it.|Den här grenen har inte sammanfogats med %{defaultBranchName}. För att undvika dataförlust bör du överväga att sammanfoga grenen innan du tar bort den.

source: Branches|To discard the local changes and overwrite the branch with the upstream version, delete it here and choose 'Update now' above.
sv: Branches|To discard the local changes and overwrite the branch with the upstream version, delete it here and choose 'Update now' above.|Ta bort lokala ändringar och skriv över grenen med uppströmsversionen genom att ta bort den här och välja ”Uppdatera nu” ovan.

source: Branches|View branch rules
sv: Branches|View branch rules|Visa grenregler

source: BroadcastMessages|Leave blank to target all group and project pages.
sv: BroadcastMessages|Leave blank to target all group and project pages.|Lämna tomt för att välja alla grupp- och projektsidor.

source: Building your merge request… This page will update when the build is complete.
sv: Building your merge request… This page will update when the build is complete.|Din sammanfogningsbegäran byggs … Sidan uppdateras när bygget är klart.

source: BulkImport|must belong to a project.
sv: BulkImport|must belong to a project.|måste tillhöra ett projekt.

source: Bypassing blocking reviews will allow the merge request to be merged even if any reviewer has requested changes. This applies to future reviews as well.
sv: Bypassing blocking reviews will allow the merge request to be merged even if any reviewer has requested changes. This applies to future reviews as well.|Genom att kringgå blockerande granskningar kan sammanfogningsbegäran sammanfogas även om en granskare har begärt ändringar. Detta gäller även framtida granskningar.

source: CVE|Enable CVE ID requests in the issue sidebar
sv: CVE|Enable CVE ID requests in the issue sidebar|Aktivera begäranden om CVE-ID i ärendets sidofält

source: Calculations are made based on projects in the current group. Projects in subgroups are not included.
sv: Calculations are made based on projects in the current group. Projects in subgroups are not included.|Beräkningar görs utifrån projekten i den aktuella gruppen. Projekt i undergrupper ingår inte.

source: Can only be present for group level value streams
sv: Can only be present for group level value streams|Kan endast finnas för värdeströmmar på gruppnivå

source: Can't apply as the source branch was deleted.
sv: Can't apply as the source branch was deleted.|Det går inte att tillämpa eftersom källgrenen har tagits bort.

source: Can't find HEAD commit for this branch
sv: Can't find HEAD commit for this branch|Det gick inte att hitta HEAD-incheckningen för den här grenen

source: Cancel the running pipeline
sv: Cancel the running pipeline|Avbryt den pågående pipelinen

source: Cannot create organization. The `o` namespace is a reserved path. Please rename the group or user before creating an organization.
sv: Cannot create organization. The `o` namespace is a reserved path. Please rename the group or user before creating an organization.|Det går inte att skapa organisationen. Namnområdet `o` är en reserverad sökväg. Byt namn på gruppen eller användaren innan du skapar en organisation.

source: Cannot merge until this date and time.
sv: Cannot merge until this date and time.|Det går inte att sammanfoga före detta datum och denna tid.

source: Cannot push to source branch
sv: Cannot push to source branch|Det går inte att skicka upp till källgrenen

source: Cannot refer to a group milestone by an internal id!
sv: Cannot refer to a group milestone by an internal id!|Det går inte att referera till en gruppmilstolpe med ett internt ID!

source: ChangeTypeAction|Pick into branch
sv: ChangeTypeAction|Pick into branch|Välj in i gren

source: ChangeTypeAction|Pick into project
sv: ChangeTypeAction|Pick into project|Välj in i projekt

source: ChangeTypeAction|Revert in branch
sv: ChangeTypeAction|Revert in branch|Återställ i gren

source: ChangeTypeAction|Switch branch
sv: ChangeTypeAction|Switch branch|Byt gren

source: ChangeTypeAction|Switch project
sv: ChangeTypeAction|Switch project|Byt projekt

source: ChangeTypeAction|Your changes will be committed to %{branchName} because a merge request is open.
sv: ChangeTypeAction|Your changes will be committed to %{branchName} because a merge request is open.|Dina ändringar kommer att checkas in i %{branchName} eftersom en sammanfogningsbegäran är öppen.

source: Changed merge method to %{merge_method}
sv: Changed merge method to %{merge_method}|Ändrade sammanfogningsmetod till %{merge_method}

source: Changes requested to the current merge request.
sv: Changes requested to the current merge request.|Ändringar har begärts i den aktuella sammanfogningsbegäran.

source: ChatMessage|%{project_link}: Pipeline %{pipeline_link} of %{ref_type} %{ref_link} by %{user_combined_name} %{humanized_status} in %{duration}
sv: ChatMessage|%{project_link}: Pipeline %{pipeline_link} of %{ref_type} %{ref_link} by %{user_combined_name} %{humanized_status} in %{duration}|%{project_link}: Pipeline %{pipeline_link} för %{ref_type} %{ref_link} av %{user_combined_name} %{humanized_status} på %{duration}

source: ChatMessage|Branch
sv: ChatMessage|Branch|Gren

source: ChatMessage|Invalid CI config YAML file
sv: ChatMessage|Invalid CI config YAML file|Ogiltig YAML-fil för CI-konfiguration

source: ChatMessage|Pipeline #%{pipeline_id} %{humanized_status} in %{duration}
sv: ChatMessage|Pipeline #%{pipeline_id} %{humanized_status} in %{duration}|Pipeline #%{pipeline_id} %{humanized_status} på %{duration}
